//
//  TestEnter.swift
//  CubeScene
//
//  Created by yanguo sun on 2023/11/5.
//

import SwiftUI

// 集成到这里有点问题。。。。 2的原点不都是第一个点。。。，导致旋转方向不可靠
struct TestEnter: View {

    let items = [
//        "right, up"
        transMatrix(with:
                        [[[-1, 2, -1], [-1, -1, -1], [-1, -1, -1]],
                         [[-1, 2, -1], [-1, 2, -1], [-1, 2, -1]],
                         [[-1, -1, -1], [-1, -1, -1], [-1, -1, -1]],]),
//        "right, down"
//        transMatrix(with:
//                        [[[-1, -1, -1], [-1, -1, -1], [-1, -1, -1]],
//                         [[-1, 2, -1], [-1, 2, -1], [-1, 2, -1]],
//                         [[-1, 2, -1], [-1, -1, -1], [-1, -1, -1]],]),
//        "right, back"
        transMatrix(with:
                        [[[-1, -1, -1], [-1, -1, -1], [-1, -1, -1]],
                         [[-1, 2, 2], [-1, 2, -1], [-1, 2, -1]],
                         [[-1, -1, -1], [-1, -1, -1], [-1, -1, -1]],]),
//        "right, front"
//        transMatrix(with:
//                        [[[-1, -1, -1], [-1, -1, -1], [-1, -1, -1]],
//                         [[2, 2, -1], [-1, 2, -1], [-1, 2, -1]],
//                         [[-1, -1, -1], [-1, -1, -1], [-1, -1, -1]],]),
//        "left, up"
//        transMatrix(with:
//                        [[[-1, -1, -1], [-1, -1, -1], [-1, 2, -1]],
//                         [[-1, 2, -1], [-1, 2, -1], [-1, 2, -1]],
//                         [[-1, -1, -1], [-1, -1, -1], [-1, -1, -1]],]),
//        "left, down"
//        transMatrix(with:
//                        [[[-1, -1, -1], [-1, -1, -1], [-1, -1, -1]],
//                         [[-1, 2, -1], [-1, 2, -1], [-1, 2, -1]],
//                         [[-1, -1, -1], [-1, -1, -1], [-1, 2, -1]],]),
//        "left, back"
//        transMatrix(with:
//                        [[[-1, -1, -1], [-1, -1, -1], [-1, -1, -1]],
//                         [[-1, 2, -1], [-1, 2, -1], [-1, 2, 2]],
//                         [[-1, -1, -1], [-1, -1, -1], [-1, -1, -1]],]),
//        "left, front"
//        transMatrix(with:
//                        [[[-1, -1, -1], [-1, -1, -1], [-1, -1, -1]],
//                         [[-1, 2, -1], [-1, 2, -1], [2, 2, -1]],
//                         [[-1, -1, -1], [-1, -1, -1], [-1, -1, -1]],]),
//        "front, left"
//        (x:1, y:1, z:2, value:2) (x:1, y:1, z:1, value:2) (x:1, y:1, z:0, value:2) (x:1, y:0, z:0, value:2)
//        transMatrix(with:
//                        [[[-1, -1, -1], [-1, -1, -1], [-1, -1, -1]],
//                         [[-1, -1, -1], [2, 2, 2], [2, -1, -1]],
//                         [[-1, -1, -1], [-1, -1, -1], [-1, -1, -1]],]),
//        "back, up"
//        (true, Optional((x:1, y:1, z:0, value:2)), "back, up")
//        transMatrix(with:
//                        [[[-1, -1, -1], [-1, -1, 2], [-1, -1, -1]],
//                         [[-1, -1, -1], [2, 2, 2],    [-1, -1, -1]],
//                         [[-1, -1, -1], [-1, -1, -1], [-1, -1, -1]],]),
    ]

    var body: some View {
        List(items, id: \.self) { item in
            NavigationLink {
                SingleContentView2(nodeList: makeNode(with: item))
            } label: {
                Text("\(items.firstIndex(of: item).debugDescription)")
            }

        }
    }
}


struct TestEnter_Previews: PreviewProvider {
    static var previews: some View {
        TestEnter()
    }
}
